-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2022-07-05 08:49:46
-- サーバのバージョン： 10.4.21-MariaDB
-- PHP のバージョン: 8.0.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `shop_site`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `cart`
--

CREATE TABLE `cart` (
  `item` text NOT NULL,
  `price` int(11) NOT NULL,
  `shop` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- テーブルの構造 `kourakuen`
--

CREATE TABLE `kourakuen` (
  `id` int(11) NOT NULL,
  `item` text NOT NULL,
  `price` int(11) NOT NULL,
  `shop` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `kourakuen`
--

INSERT INTO `kourakuen` (`id`, `item`, `price`, `shop`) VALUES
(1, '中華そばプレミアム', 740, '幸楽苑'),
(2, 'ねぎらーめん', 540, '幸楽苑'),
(3, '煮卵らーめん', 540, '幸楽苑'),
(4, '味噌らーめんプレミアム', 740, '幸楽苑'),
(5, '辛し味噌野菜たんめん', 740, '幸楽苑'),
(6, '味噌野菜らーめん', 540, '幸楽苑'),
(7, '塩らーめんプレミアム', 740, '幸楽苑'),
(8, '塩ねぎらーめん', 540, '幸楽苑'),
(9, '塩野菜らーめん', 540, '幸楽苑'),
(10, '塩煮卵らーめん', 540, '幸楽苑'),
(11, 'とんこつチャーシューめん', 640, '幸楽苑'),
(12, 'つけめんプレミアム', 740, '幸楽苑');

-- --------------------------------------------------------

--
-- テーブルの構造 `marukame`
--

CREATE TABLE `marukame` (
  `id` int(11) NOT NULL,
  `item` text NOT NULL,
  `price` int(11) NOT NULL,
  `shop` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `marukame`
--

INSERT INTO `marukame` (`id`, `item`, `price`, `shop`) VALUES
(1, '鴨ねぎうどん　並', 690, '丸亀製麺'),
(2, '鴨ねぎうどん　大', 800, '丸亀製麺'),
(3, '鴨ねぎうどん　得', 910, '丸亀製麺'),
(4, '玉子あんかけ　並', 450, '丸亀製麺'),
(5, '玉子あんかけ　大', 560, '丸亀製麺'),
(6, '玉子あんかけ　得', 670, '丸亀製麺'),
(7, '釜玉うどん　並', 370, '丸亀製麺'),
(8, '釜玉うどん　大', 480, '丸亀製麺'),
(9, '釜玉うどん　得', 590, '丸亀製麺'),
(10, '釜揚げうどん　並', 290, '丸亀製麺'),
(11, '釜揚げうどん　大', 400, '丸亀製麺'),
(12, '釜揚げうどん　得', 510, '丸亀製麺'),
(13, 'とろろ醤油うどん　並', 390, '丸亀製麺'),
(14, 'とろろ醤油うどん　大', 500, '丸亀製麺'),
(15, 'とろろ醤油うどん　得', 610, '丸亀製麺'),
(16, 'ぶっかけうどん　並', 300, '丸亀製麺'),
(17, 'ぶっかけうどん　大', 410, '丸亀製麺'),
(18, 'ぶっかけうどん　得', 520, '丸亀製麺'),
(19, 'カレーうどん　並', 490, '丸亀製麺'),
(20, 'カレーうどん　大', 600, '丸亀製麺'),
(21, 'カレーうどん　得', 710, '丸亀製麺'),
(22, 'とろ玉うどん　並', 440, '丸亀製麺'),
(23, 'とろ玉うどん　大', 550, '丸亀製麺'),
(24, 'とろ玉うどん　得', 660, '丸亀製麺'),
(25, 'きつねうどん　並', 440, '丸亀製麺'),
(26, 'きつねうどん　大', 550, '丸亀製麺'),
(27, 'きつねうどん　得', 660, '丸亀製麺'),
(28, 'ざるうどん　並', 300, '丸亀製麺'),
(29, 'ざるうどん　大', 410, '丸亀製麺'),
(30, 'ざるうどん　得', 520, '丸亀製麺'),
(31, '肉うどん　並', 590, '丸亀製麺'),
(32, '肉うどん　大', 700, '丸亀製麺'),
(33, '肉うどん　得', 810, '丸亀製麺'),
(34, '牛すき釜玉うどん　並', 690, '丸亀製麺'),
(35, '牛すき釜玉うどん　大', 800, '丸亀製麺'),
(36, '牛すき釜玉うどん　得', 910, '丸亀製麺'),
(37, '野菜かき揚げ　１ヶ', 140, '丸亀製麺'),
(38, 'えび天　1ヶ', 160, '丸亀製麺'),
(39, 'さつまいも天　１ヶ', 110, '丸亀製麺'),
(40, 'かぼちゃ天　１ヶ', 110, '丸亀製麺');

-- --------------------------------------------------------

--
-- テーブルの構造 `matsuya`
--

CREATE TABLE `matsuya` (
  `id` int(11) NOT NULL,
  `item` text NOT NULL,
  `price` int(11) NOT NULL,
  `shop` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `matsuya`
--

INSERT INTO `matsuya` (`id`, `item`, `price`, `shop`) VALUES
(1, 'プレミアム牛めし　ミニ盛', 330, '松屋'),
(2, 'プレミアム牛めし　並盛', 380, '松屋'),
(3, 'プレミアム牛めし　あたま大盛', 480, '松屋'),
(4, 'プレミアム牛めし　大盛', 530, '松屋'),
(5, 'プレミアム牛めし　特盛', 650, '松屋'),
(6, '創業ビーフカレー　並盛', 490, '松屋'),
(7, '創業ビーフカレー　大盛', 590, '松屋'),
(8, '創業プレミアムビーフカレギュウ　並盛', 720, '松屋'),
(9, '創業プレミアムビーフカレギュウ　大盛', 820, '松屋'),
(10, '創業ハンバーグビーフカレー　並盛', 720, '松屋'),
(11, '創業ハンバーグビーフカレー　大盛', 820, '松屋'),
(12, 'お肉たっぷり焼き牛めし　並盛', 560, '松屋'),
(13, 'お肉たっぷり焼き牛めし　大盛', 690, '松屋'),
(14, 'キムカル丼　並盛', 500, '松屋'),
(15, 'キムカル丼　大盛', 630, '松屋'),
(16, 'キムカル丼　特盛', 780, '松屋'),
(17, 'ネギたっぷりネギ塩豚肩ロース丼　並盛', 500, '松屋'),
(18, 'ネギたっぷりネギ塩豚肩ロース丼　大盛', 630, '松屋'),
(19, 'ビビン丼　並盛', 500, '松屋'),
(20, 'ビビン丼　大盛', 600, '松屋'),
(21, 'シュクメルリ鍋定食', 790, '松屋'),
(22, 'カルビ焼肉定食', 660, '松屋'),
(23, 'ブラウンソースエッグハンバーグ定食', 680, '松屋'),
(24, 'マッサマンカレー　並盛', 730, '松屋'),
(25, 'マッサマンカレー　大盛', 790, '松屋');

-- --------------------------------------------------------

--
-- テーブルの構造 `ringerhut`
--

CREATE TABLE `ringerhut` (
  `id` int(11) NOT NULL,
  `item` text NOT NULL,
  `price` int(11) NOT NULL,
  `shop` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `ringerhut`
--

INSERT INTO `ringerhut` (`id`, `item`, `price`, `shop`) VALUES
(1, '長崎ちゃんぽん　', 590, 'Ringer Hut'),
(2, '長崎ちゃんぽん　野菜たっぷり', 740, 'Ringer Hut'),
(3, '減塩 長崎ちゃんぽん', 640, 'Ringer Hut'),
(4, 'ピリカラちゃんぽん', 650, 'Ringer Hut'),
(5, '長崎皿うどん', 620, 'Ringer Hut'),
(6, '長崎皿うどん　野菜たっぷり', 750, 'Ringer Hut'),
(7, '太めん皿うどん', 750, 'Ringer Hut'),
(8, '減塩 長崎皿うどん', 640, 'Ringer Hut'),
(9, '牛・がっつりまぜめん', 740, 'Ringer Hut'),
(10, '野菜たっぷり食べるスープ', 700, 'Ringer Hut'),
(11, '薄皮ぎょうざ定食（7個）', 370, 'Ringer Hut'),
(12, '薄皮ぎょうざ定食（10個）', 550, 'Ringer Hut'),
(13, '薄皮ぎょうざ定食（15個）', 590, 'Ringer Hut'),
(14, '半チャーハン', 260, 'Ringer Hut'),
(15, 'ごはん（大盛り無料）', 0, 'Ringer Hut');

-- --------------------------------------------------------

--
-- テーブルの構造 `sukiya`
--

CREATE TABLE `sukiya` (
  `id` int(11) NOT NULL,
  `item` text NOT NULL,
  `price` int(11) NOT NULL,
  `shop` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `sukiya`
--

INSERT INTO `sukiya` (`id`, `item`, `price`, `shop`) VALUES
(1, '牛丼　ミニ', 290, 'すき家'),
(2, '牛丼　並盛', 350, 'すき家'),
(3, '牛丼　中盛', 480, 'すき家'),
(4, '牛丼　大盛', 480, 'すき家'),
(5, '牛丼　特盛', 630, 'すき家'),
(6, '牛丼　メガ', 780, 'すき家'),
(7, 'キムチ牛丼　ミニ', 420, 'すき家'),
(8, 'キムチ牛丼　並盛', 480, 'すき家'),
(9, 'キムチ牛丼　中盛', 610, 'すき家'),
(10, 'キムチ牛丼　大盛', 610, 'すき家'),
(11, 'キムチ牛丼　特盛', 760, 'すき家'),
(12, 'キムチ牛丼　メガ', 910, 'すき家'),
(13, 'ねぎ玉牛丼　ミニ', 420, 'すき家'),
(14, 'ねぎ玉牛丼　並盛', 480, 'すき家'),
(15, 'ねぎ玉牛丼　中盛', 610, 'すき家'),
(16, 'ねぎ玉牛丼　大盛', 610, 'すき家'),
(17, 'ねぎ玉牛丼　特盛', 760, 'すき家'),
(18, 'ねぎ玉牛丼　メガ', 910, 'すき家'),
(19, 'とろ〜り3種のチーズ牛丼　ミニ', 440, 'すき家'),
(20, 'とろ〜り3種のチーズ牛丼　並盛', 500, 'すき家'),
(21, 'とろ〜り3種のチーズ牛丼　中盛', 630, 'すき家'),
(22, 'とろ〜り3種のチーズ牛丼　大盛', 630, 'すき家'),
(23, 'とろ〜り3種のチーズ牛丼　特盛', 780, 'すき家'),
(24, 'とろ〜り3種のチーズ牛丼　メガ', 930, 'すき家'),
(25, '牛すき鍋定食', 780, 'すき家'),
(26, 'チーズ尽くしのガーリックトマト牛鍋定食', 890, 'すき家'),
(27, 'マンハッタンデラックスカレー　ミニ', 790, 'すき家'),
(28, 'マンハッタンデラックスカレー　並盛', 890, 'すき家'),
(29, 'マンハッタンデラックスカレー　1.5盛', 990, 'すき家'),
(30, 'マンハッタンデラックスカレー　大盛', 1030, 'すき家'),
(31, 'マンハッタンデラックスカレー　特盛', 1130, 'すき家'),
(32, 'チーズ牛カレー　ミニ', 670, 'すき家'),
(33, 'チーズ牛カレー　並盛', 770, 'すき家'),
(34, 'チーズ牛カレー　1.5盛', 870, 'すき家'),
(35, 'チーズ牛カレー　大盛', 910, 'すき家'),
(36, 'チーズ牛カレー　特盛', 1010, 'すき家'),
(37, 'カレー　ミニ', 380, 'すき家'),
(38, 'カレー　並盛', 480, 'すき家'),
(39, 'カレー　1.5盛', 580, 'すき家'),
(40, 'カレー　大盛', 620, 'すき家'),
(41, 'カレー　特盛', 720, 'すき家'),
(42, '牛皿定食　（肉）並盛', 560, 'すき家'),
(43, '牛皿定食　（肉）中盛', 690, 'すき家'),
(44, '牛皿定食　（肉）2倍盛', 790, 'すき家'),
(45, '鮭定食　ごはんミニ', 490, 'すき家'),
(46, '鮭定食　ごはん並', 520, 'すき家'),
(47, '鮭定食　ごはん大盛', 550, 'すき家'),
(48, '納豆定食　ごはんミニ', 380, 'すき家'),
(49, '納豆定食　ごはん並', 410, 'すき家'),
(50, '納豆定食　ごはん大盛', 440, 'すき家');

-- --------------------------------------------------------

--
-- テーブルの構造 `yoshinoya`
--

CREATE TABLE `yoshinoya` (
  `id` int(11) NOT NULL,
  `item` text NOT NULL,
  `price` int(11) NOT NULL,
  `shop` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `yoshinoya`
--

INSERT INTO `yoshinoya` (`id`, `item`, `price`, `shop`) VALUES
(1, '牛丼　小盛', 332, '吉野家'),
(2, '牛丼　並盛', 352, '吉野家'),
(3, '牛丼　アタマの大盛', 462, '吉野家'),
(4, '牛丼　大盛', 522, '吉野家'),
(5, '牛丼　特盛', 642, '吉野家'),
(6, '牛丼　超特盛', 732, '吉野家'),
(7, 'ねぎ玉牛丼　小盛', 440, '吉野家'),
(8, 'ねぎ玉牛丼　並盛', 460, '吉野家'),
(9, 'ねぎ玉牛丼　アタマの大盛', 570, '吉野家'),
(10, 'ねぎ玉牛丼　大盛', 630, '吉野家'),
(11, 'ねぎ玉牛丼　特盛', 750, '吉野家'),
(12, 'ねぎ玉牛丼　超特盛', 840, '吉野家'),
(13, '豚丼　小盛', 332, '吉野家'),
(14, '豚丼　並盛', 353, '吉野家'),
(15, '豚丼　アタマの大盛', 462, '吉野家'),
(16, '豚丼　大盛', 522, '吉野家'),
(17, '豚丼　特盛', 642, '吉野家'),
(18, '豚丼　超特盛', 732, '吉野家'),
(19, 'チーズ豚丼　小盛', 440, '吉野家'),
(20, 'チーズ豚丼　並盛', 460, '吉野家'),
(21, 'チーズ豚丼　アタマの大盛', 570, '吉野家'),
(22, 'チーズ豚丼　大盛', 630, '吉野家'),
(23, 'チーズ豚丼　特盛', 750, '吉野家'),
(24, 'チーズ豚丼　超特盛', 840, '吉野家'),
(25, '牛カルビ丼　小盛', 528, '吉野家'),
(26, '牛カルビ丼　並盛', 548, '吉野家'),
(27, '牛カルビ丼　アタマの大盛', 658, '吉野家'),
(28, '牛カルビ丼　大盛', 718, '吉野家'),
(29, '牛カルビ丼　特盛', 838, '吉野家'),
(30, '牛カルビ丼　超特盛', 928, '吉野家'),
(31, '牛の鍋焼き定食', 598, '吉野家'),
(32, '牛すき鍋膳　並盛', 648, '吉野家'),
(33, '牛すき鍋膳　大盛', 748, '吉野家'),
(34, '牛鍋ファミリーパック　3人前', 748, '吉野家'),
(35, '牛鍋ファミリーパック　4人前', 948, '吉野家'),
(36, 'スタミナ超特盛丼　超特盛', 798, '吉野家'),
(37, '牛カレー　並盛', 498, '吉野家'),
(38, '牛カレー　大盛', 549, '吉野家'),
(39, 'カレー　並盛', 358, '吉野家'),
(40, 'カレー　大盛', 408, '吉野家'),
(41, '牛カルビカレー　並盛', 598, '吉野家'),
(42, '牛カルビカレー　大盛', 648, '吉野家'),
(43, '牛×牛カルビカレー　並盛', 738, '吉野家'),
(44, '牛×牛カルビカレー　大盛', 788, '吉野家'),
(45, '牛皿定食　並盛', 498, '吉野家'),
(46, '牛皿定食　大盛', 598, '吉野家'),
(47, '牛皿定食　特盛', 698, '吉野家'),
(48, '牛カルビ定食', 598, '吉野家'),
(49, '牛鮭定食', 548, '吉野家');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `kourakuen`
--
ALTER TABLE `kourakuen`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `marukame`
--
ALTER TABLE `marukame`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `matsuya`
--
ALTER TABLE `matsuya`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `ringerhut`
--
ALTER TABLE `ringerhut`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `sukiya`
--
ALTER TABLE `sukiya`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `yoshinoya`
--
ALTER TABLE `yoshinoya`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `kourakuen`
--
ALTER TABLE `kourakuen`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- テーブルの AUTO_INCREMENT `marukame`
--
ALTER TABLE `marukame`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;

--
-- テーブルの AUTO_INCREMENT `matsuya`
--
ALTER TABLE `matsuya`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- テーブルの AUTO_INCREMENT `ringerhut`
--
ALTER TABLE `ringerhut`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- テーブルの AUTO_INCREMENT `sukiya`
--
ALTER TABLE `sukiya`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- テーブルの AUTO_INCREMENT `yoshinoya`
--
ALTER TABLE `yoshinoya`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=50;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
